# Linear Regression Multiple Variables

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
home_price = pd.read_csv('homeprices.csv')
home_price

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [3]:
missing_val = home_price['bedrooms'].median()
missing_val

4.0

In [4]:
home_price.fillna(missing_val,inplace=True)
home_price

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [5]:
# X 
X = home_price.drop('price',axis=1)
X

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.0   18
3  3600       3.0   30
4  4000       5.0    8
5  4100       6.0    8

In [15]:
y = home_price['price']
y

0    550000
1    565000
2    610000
3    595000
4    760000
5    810000
Name: price, dtype: int64

In [16]:
from sklearn import linear_model
reg = linear_model.LinearRegression()
reg.fit(X.values,y)

LinearRegression()

In [17]:
reg.predict([[3000, 3, 40]])

array([498408.25158031])